package com.example.courslearn;

public class QuestionAnswer {
    public static String question[] ={
            "Что такое алгоритм и какова его основная цель?",
            "Как можно классифицировать алгоритмы?",
            "В каких областях не применяются алгоритмы?",
            "Каково значение понимания алгоритмов?"
    };

    public static String choices[][] = {
            {"Это четко определенная последовательность действий, предназначенная для решения конкретной задачи.\n", "Это случайная последовательность действий.", "это набор данных без инструкций", " это только математическая формула"},
            {"На простые и сложные", "На линейные, разветвляющиеся и циклические.\n","На алгоритмы поиска и сортировки.\n","На статические и динамические.\n"},
            {"В программировании.\n","В медицине.\n","В исскустве.\n","В финансовом секторе.\n"},
            {"Понимание алгоритмов не имеет значения.\n","Понимание алгоритмов помогает развивать логическое мышление и умение анализировать задачи.\n","Понимание алгоритмов требуется только для математиков.\n","Понимание алгоритмов нужно только в программировании.\n"}
    };

    public static String correctAnswers[] = {
            "Это четко определенная последовательность действий, предназначенная для решения конкретной задачи.\n",
            "На линейные, разветвляющиеся и циклические.\n",
            "В исскустве.\n",
            "Понимание алгоритмов помогает развивать логическое мышление и умение анализировать задачи.\n"
    };
}
